<?php
//Функции для работы с массивами

//Слияние массивов

$arr1 = ['my', 'dog'];
$arr2 = [0, 0, 'your', 'cat'];

$sum = array_merge($arr1, $arr2);

echo "<pre>";
print_r($sum);
echo "</pre>";


//Сравнение массивов
// $a0 = [1, 2, 3, 4, 5];
// $a1 = [1, 2, 3, 4, 5];
// $a2 = [1, 2, 6, 4];
// $a3 = [1, 8, 3, 4, 5];
// $a4 = [1, 2, 3, 7, 5];


// if($a0 == $a2){
//     echo "Массивы равны";
// }
// else {
//     echo "Массивы не равны";
// }

// ===
$a0 = [0 => 1, 1 => 2];
$a1 = [0 => 1, 1 => '2'];

if($a0 === $a1){
    echo "Массивы равны";
}
else {
    echo "Массивы не равны";
}


$num = count($a1);
echo $num;


?>